---
kind: other
id: Properties.T:Autodesk.Revit.DB.SpecTypeId.Reference
source: html/e6410045-9c5a-7f2d-2805-3d5828aceb66.htm
---
# SpecTypeId.Reference Properties

Fill Pattern, in discipline Common.